In [1]:
import sqlite3

In [9]:
db=sqlite3.connect("my_database1.db")
db.execute("drop table if exists TIMES1")
db.execute("create table TIMES1(name text ,emp_id int,salary int,gender text,age int)")
db.execute("insert into TIMES1(name,emp_id,salary,gender,age)values('Saurav',100001,20200,'Male',25)")
db.execute("insert into TIMES1(name,emp_id,salary,gender,age)values('Gaurav',100002,30200,'Male',35)")
db.execute("insert into TIMES1(name,emp_id,salary,gender,age)values('Lovely',100003,45200,'Female',20)")
db.execute("insert into TIMES1(name,emp_id,salary,gender,age)values('Rohit',100004,90200,'Male',35)")
db.execute("insert into TIMES1(name,emp_id,salary,gender,age)values('Ratnesh',100005,70200,'Male',47)")
db.execute("insert into TIMES1(name,emp_id,salary,gender,age)values('Shailesh',100006,15200,'Male',50)")
db.execute("insert into TIMES1(name,emp_id,salary,gender,age)values('Madhvi',100007,45200,'Female',24)")
db.execute("insert into TIMES1(name,emp_id,salary,gender,age)values('Riya',100008,35600,'Female',52)")
db.execute("insert into TIMES1(name,emp_id,salary,gender,age)values('Sagar',100009,87400,'Male',32)")
db.execute("insert into TIMES1(name,emp_id,salary,gender,age)values('Amisha',100010,12000,'Female',20)")

In [10]:
db.commit()

In [13]:
print('*'*60)
result=db.execute("select * from TIMES1 order by emp_id")
for row in result:
    print(row)
print('*'*60)

************************************************************
('Saurav', 100001, 20200, 'Male', 25)
('Gaurav', 100002, 30200, 'Male', 35)
('Lovely', 100003, 45200, 'Female', 20)
('Rohit', 100004, 90200, 'Male', 35)
('Ratnesh', 100005, 70200, 'Male', 47)
('Shailesh', 100006, 15200, 'Male', 50)
('Madhvi', 100007, 45200, 'Female', 24)
('Riya', 100008, 35600, 'Female', 52)
('Sagar', 100009, 87400, 'Male', 32)
('Amisha', 100010, 12000, 'Female', 20)
************************************************************

In [17]:
print('*'*60)
result=db.execute("select * from TIMES1 where age<=30")
for row in result:
    print(row)
print('*'*60)

************************************************************
('Saurav', 100001, 20200, 'Male', 25)
('Lovely', 100003, 45200, 'Female', 20)
('Madhvi', 100007, 45200, 'Female', 24)
('Amisha', 100010, 12000, 'Female', 20)
************************************************************

In [24]:
print('*'*60)
result=db.execute("select * from TIMES1 order by salary desc")
for row in result:
    print (row)
print('*'*60)

************************************************************
('Rohit', 100004, 90200, 'Male', 35)
('Sagar', 100009, 87400, 'Male', 32)
('Ratnesh', 100005, 70200, 'Male', 47)
('Lovely', 100003, 45200, 'Female', 20)
('Madhvi', 100007, 45200, 'Female', 24)
('Riya', 100008, 35600, 'Female', 52)
('Gaurav', 100002, 30200, 'Male', 35)
('Saurav', 100001, 20200, 'Male', 25)
('Shailesh', 100006, 15200, 'Male', 50)
('Amisha', 100010, 12000, 'Female', 20)
************************************************************

In [27]:
print('*'*60)
result=db.execute("select name,salary from TIMES1 order by emp_id")
for row in result:
    print(row)
print('*'*60)

************************************************************
('Saurav', 20200)
('Gaurav', 30200)
('Lovely', 45200)
('Rohit', 90200)
('Ratnesh', 70200)
('Shailesh', 15200)
('Madhvi', 45200)
('Riya', 35600)
('Sagar', 87400)
('Amisha', 12000)
************************************************************

In [31]:
print('*'*60)
result=db.execute("select name from TIMES1 order by salary")
for row in result:
    print(row)
print('*'*60)

************************************************************
('Amisha',)
('Shailesh',)
('Saurav',)
('Gaurav',)
('Riya',)
('Lovely',)
('Madhvi',)
('Ratnesh',)
('Sagar',)
('Rohit',)
************************************************************